# Projeto de Bases de Dados - Parte 2

### Docente Responsável

Prof. Jorge Oliveira

### Grupo 38
<dl>
    <dt>05 horas (33.3%)</dt>
    <dd>ist100313 Henrique Carrão</dd>
    <dt>05 horas (33.3%)</dt>
    <dd>ist103335 Joana Peixinho</dd>
    <dt>05 horas (33.3%)</dt>
    <dd>ist103573 Miguel Fernandes</dd>
<dl>

# Empresa de comércio online

## 1 Conversão E-A para Modelo Relacional

Recorde a notação para o Modelo Relacional exposta nas aulas teóricas como se segue:

- relacaoA (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)
- relacaoB (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)

1. As relações são expressas por um nome seguido dos atributos entre parêntesis;
    - As chave primárias são expressas sublinhando os atributos que a compõem;
    - As chaves estrangeiras para outras relações são expressas através da lista de atributos que a compõem, seguida de “: FK(RelacaoDestino)”. A ordem dos atributos que compõem a FK deve corresponder à ordem dos atributos da chave na relação destino;
    - As chaves candidatas são expressas através da expressão “unique”, seguida da lista de atributos que a compõem entre parêntesis;
    - As restrições de integridade ao Modelo Relacional são descritas em termos dos conceitos deste modelo.

### 1.1 Modelo Relacional com Restrições de Integridade

1. Desenvolva um Modelo Relacional correspondente ao modelo Entidade-Associação;
2. Complemente a seu Modelo Relacional com um conjunto de Restrições de Integridade que represente o modelo E-A apresentado com a maior fidelidade.

- customer (<u>cust_no</u>, name ,email, phone, address)
    - unique(email) NOT NULL
    - unique(phone)
    
- order (<u>order_no</u>, date, cust_no)
    - cust_no: FK (Customer) NOT NULL
    - date: NOT NULL
    
- IC - 1: order_no must exist in order and contains

- sale (<u>order_no</u>, is_paid)
    - order_no: FK (order)
    - is_paid: NOT NULL
    
- product (<u>sku</u>, name, description,price, EAN)
    - name: NOT NULL
    - price: NOT NULL
    - unique(EAN)
    
- IC - 2: sku must exist in order and supplier

- contains(<u>order_no</u>,<u> sku</u>, qty)
    - order_no: FK (order) 
    - sku: FK (product)
    - qty: NOT NULL

- supplier (<u>TIN</u>,name, address, date, sku)
    - sku: FK (product) NOT NULL
    
- employee (<u> ssn </u>, TIN, bdate, name)
    - unique( TIN ) NOT NULL
    - bdate: NOT NULL
    - name: NOT NULL
    
- process( <u>ssn </u>,<u> order_no </u>)
    - order_no: FK (order)
    - ssn: FK (employee)
    
- IC - 3: ssn must exist in employee and works

- department(<u> name </u>)

- workplace ( <u> address </u>, lat, long)
    - lat: NOT NULL
    - long: NOT NULL
    - unique(lat, long)
    
- office ( <u> address </u>)
    - address: FK (workplace) 
    
- warehouse ( <u> address </u>)
    - address: FK (workplace) 
    
- works (<u> ssn </u>, <u> name </u>, <u> address </u>)
    - ssn: FK (employee)
    - name FK (department)
    - address: FK (workplace)
    
- delivery ( <u> TIN </u>, <u> address </u> )
    - TIN: FK (supplier) 
    - address: FK (warehouse)

### 1.2 Restrições de Integridade não passíveis de conversão

Identifique todas as Restrições de Integridade do modelo Entidade-Associação apresentado que não são passíveis de conversão para o modelo relacional.

- IC - 4: Customers can only pay for the Sale of an Order they have placed themselves

## 2 Algebra Relacional

Recorde a notação exposta nas aulas teóricas como se segue:

$\Pi_{atributo1} \big( \sigma_{atributo1=atributo2} (relacaoA \bowtie relacaoB) \big)$

#### Simbolos
- $\cup$ union 			
- $\cap$ intersection 		
- $-$ difference 		
- $\times$ cartesian product 
- $\div$ division 			
- $\rho$ rename 			

- $\bowtie$ natural join 		
- $\wedge$ Logical AND 	
- $\vee$ Logical OR 	
- $\neg$ Logical NOT 	

Considerando o modelo relacional desenvolvido, apresente as expressões algébricas correspondentes a cada uma das seguintes interrogações:

1. Liste o nome de todos os clientes que fizeram encomendas contendo produtos de preço superior a €50 no ano de 2023;

$table ← \big( customer \bowtie order \bowtie contains \bowtie \Pi_{sku, price} (product) \big)$


$\Pi_{name} (\sigma_{price>50 \wedge date >= ”01-01-2023” \wedge date <= "31-12-2023"} (table))$

2. Liste o nome de todos os empregados que trabalham em armazéns e não em escritórios e processaram encomendas em Janeiro de 2023;

$table1 ←  \big( employee \bowtie \Pi_{ssn, address} (works)\bowtie warehouse ) \big) - \big( employee \bowtie \Pi_{ssn, address} (works)\bowtie office ) \big)$

$ table2 ← table1 \bowtie process \bowtie order $

 $\Pi_{name} \big (\sigma_ {date  >= ”01-01-2023 ” \wedge date <=”31-01-2023 ”  } ( table2))  $

3. Indique o nome do produto mais vendido;



$ table ← _{sku}G_{sum(qty)  → qty} \big(sale \bowtie contains \bowtie product \big) $ 

$\Pi_{name} ( G _{max (qty) → qty }  (table) \bowtie table \bowtie product ) $

4. Indique o valor total de cada venda realizada.

$  table ← sale \bowtie contains \bowtie product $

$ _{order\_no}G_{sum(qty*price) → total\_price} (table) $

## 3 Tradução do Modelo Relacional para SQL

### 3.1 Esquema Relacional (schema.sql)

Crie uma base de dados SQL correspondente ao esquema Relacional desenvolvido no ponto anterior.
Utilizando a linguagem SQL (DDL), apresente as instruções para criar o esquema de bases de dados correspondente ao modelo relacional desenvolvido. Deve certificar-se de que os tipos de dados e tamanhos de campo selecionados sejam os mais apropriados. As restrições aplicáveis a cada campo, linha e tabela também devem ser especificadas recorrendo às instruções NOT NULL, CHECK, PRIMARY KEY, UNIQUE e FOREIGN KEY conforme seja apropriado.


Nota: Apresente todas as restrições existentes no modelo Relacional que não podem ser capturadas (implementadas) no esquema SQL, escrevendo-as como comentários na tabela respectiva.

In [5]:
%load_ext sql
%sql postgresql://db:db@postgres/db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [32]:
%%sql
-- Drop table "delivery" and its dependencies
DROP TABLE IF EXISTS delivery CASCADE;

-- Drop table "works" and its dependencies
DROP TABLE IF EXISTS works CASCADE;

-- Drop table "warehouse" and its dependencies
DROP TABLE IF EXISTS warehouse CASCADE;

-- Drop table "office" and its dependencies
DROP TABLE IF EXISTS office CASCADE;

-- Drop table "workplace" and its dependencies
DROP TABLE IF EXISTS workplace CASCADE;

-- Drop table "department" and its dependencies
DROP TABLE IF EXISTS department CASCADE;

-- Drop table "process" and its dependencies
DROP TABLE IF EXISTS process CASCADE;

-- Drop table "employee" and its dependencies
DROP TABLE IF EXISTS employee CASCADE;

-- Drop table "supplier" and its dependencies
DROP TABLE IF EXISTS supplier CASCADE;

-- Drop table "contains" and its dependencies
DROP TABLE IF EXISTS contains CASCADE;

-- Drop table "product" and its dependencies
DROP TABLE IF EXISTS product CASCADE;

-- Drop table "sale" and its dependencies
DROP TABLE IF EXISTS sale CASCADE;

-- Drop table "order_" and its dependencies
DROP TABLE IF EXISTS order_ CASCADE;

-- Drop table "customer"
DROP TABLE IF EXISTS customer CASCADE;

-- Create table "workplace" first
CREATE TABLE workplace (
  address TEXT PRIMARY KEY,
  lat_ FLOAT NOT NULL,
  long_ FLOAT NOT NULL,
  UNIQUE (lat_, long_)
);

-- Create table "department" next
CREATE TABLE department (
  name TEXT PRIMARY KEY
);

-- Create table "customer"
CREATE TABLE customer (
  cust_no INT PRIMARY KEY,
  name TEXT,
  email TEXT UNIQUE NOT NULL,
  phone TEXT UNIQUE,
  address TEXT
);

-- Create table "order"
CREATE TABLE order_ (
  order_no INT PRIMARY KEY,
  date_ DATE NOT NULL,
  cust_no INT NOT NULL,
  FOREIGN KEY (cust_no) REFERENCES customer (cust_no)
);

-- Create table "product"
CREATE TABLE product (
  sku INT PRIMARY KEY,
  name TEXT NOT NULL,
  description TEXT,
  price DECIMAL(10, 2) NOT NULL,
  EAN TEXT UNIQUE
);

-- Create table "supplier"
CREATE TABLE supplier (
  TIN INT PRIMARY KEY,
  name TEXT,
  address TEXT,
  date_ DATE NOT NULL,
  sku INT NOT NULL,
  FOREIGN KEY (sku) REFERENCES product (sku)
);

-- Create table "employee"
CREATE TABLE employee (
  ssn INT PRIMARY KEY,
  TIN INT UNIQUE NOT NULL,
  bdate DATE NOT NULL,
  name TEXT NOT NULL
);

CREATE TABLE works (
  ssn INT,
  name TEXT,
  address TEXT,
  PRIMARY KEY(ssn, name, address),
  FOREIGN KEY (ssn) REFERENCES employee (ssn),
  FOREIGN KEY (name) REFERENCES department (name),
  FOREIGN KEY (address) REFERENCES workplace (address)
);

-- Create table "process"
CREATE TABLE process (
  ssn INT,
  order_no INT,
  PRIMARY KEY(ssn, order_no),
  FOREIGN KEY (ssn) REFERENCES employee (ssn),
  FOREIGN KEY (order_no) REFERENCES order_ (order_no)
);

-- Create table "sale"
CREATE TABLE sale (
  order_no INT PRIMARY KEY,
  is_paid BOOLEAN NOT NULL,
  FOREIGN KEY (order_no) REFERENCES order_ (order_no)
);


-- Create table "contains"
CREATE TABLE contains (
  order_no INT,
  sku INT,
  PRIMARY KEY(order_no, sku),
  qty INT NOT NULL,
  FOREIGN KEY (order_no) REFERENCES order_ (order_no),
  FOREIGN KEY (sku) REFERENCES product (sku)
);

-- Create table "warehouse"
CREATE TABLE warehouse (
  address TEXT PRIMARY KEY,
  FOREIGN KEY (address) REFERENCES workplace (address)
);

CREATE TABLE office (
  address TEXT PRIMARY KEY,
  FOREIGN KEY (address) REFERENCES workplace (address)
);
-- Create table "delivery"
CREATE TABLE delivery (
  TIN INT,
  address TEXT,
  PRIMARY KEY(TIN, address),
  FOREIGN KEY (TIN) REFERENCES supplier (TIN),
  FOREIGN KEY (address) REFERENCES warehouse (address)
);

-- IC - 1: order_no must exist in order and contains
-- IC - 2: sku must exist in order and supplier
-- IC - 3: ssn must exist in employee and 
-- IC - 4: Customers can only pay for the Sale of an Order they have placed themselves

*  postgresql://db:***@postgres/db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

### 3.2 Carregamento da Base de Dados

Crie um script SQL (DML) com todas as instruções INSERT necessárias para criar alguns dados de teste sintéticos para facilitar a validação dos resultados esperados das consultas (lembre-se de que cada tabela deve conter pelo menos uma linha e que todas as consulta têm de retornar um resultado não vazio).

In [27]:
%%sql
-- populate.sql

-- INSERT ...
-- Insert data into the "workplace" table
INSERT INTO workplace (address, lat_, long_)
VALUES
  ('Workplace 1', 10.123, 20.456),
  ('Workplace 2', 30.789, 40.123),
  ('Workplace 3', 50.456, 60.789);

-- Insert data into the "warehouse" table
INSERT INTO warehouse (address)
VALUES
  ('Workplace 1');

-- Insert data into the "office" table
INSERT INTO office (address)
VALUES
  ('Workplace 2'),
  ('Workplace 3');

-- Insert data into the "department" table
INSERT INTO department (name)
VALUES
  ('Department 1'),
  ('Department 2'),
  ('Department 3');

-- Insert data into the "customer" table
INSERT INTO customer (cust_no, name, email, phone, address)
VALUES
  (1, 'John Doe', 'john.doe@example.com', '123456789', 'Address 1'),
  (2, 'Jane Smith', 'jane.smith@example.com', '987654321', 'Address 2'),
  (3, 'Mike Johnson', 'mike.johnson@example.com', '555555555', 'Address 3'),
  (4, 'Sarah Johnson', 'sarah.johnson@example.com', '918273645', 'Address 4'),
  (5, 'Michael Brown', 'michael.brown@example.com', '000000000', 'Address 5'),
  (6, 'Emily Davis', 'emily.davis@example.com', '192837465', 'Address 6');


-- Insert data into the "order_" table
INSERT INTO "order_" (order_no, date_, cust_no)
VALUES
  (1001, '2023-01-01', 1),
  (1002, '2023-02-01', 2),
  (1003, '2023-01-01', 3),
  (1004, '2023-03-01', 4),
  (1005, '2023-04-01', 5),
  (1006, '2023-01-15', 6);

-- Insert data into the "product" table
INSERT INTO product (sku, name, description, price, EAN)
VALUES
  (10001, 'Product 1', 'Description 1', 10.99, 'EAN1'),
  (10002, 'Product 2', 'Description 2', 20.99, 'EAN2'),
  (10003, 'Product 3', 'Description 3', 50.99, 'EAN3'),
  (10004, 'Product 4', 'Description 4', 60.99, 'EAN4'),
  (10005, 'Product 5', 'Description 5', 70.99, 'EAN5'),
  (10006, 'Product 6', 'Description 6', 80.99, 'EAN6');
  

-- Insert data into the "supplier" table
INSERT INTO supplier (TIN, name, address, date_, sku)
VALUES
  (100001, 'Supplier 1', 'Supplier Address 1', '2022-01-01', 10001),
  (100002, 'Supplier 2', 'Supplier Address 2', '2022-02-01', 10002),
  (100003, 'Supplier 3', 'Supplier Address 3', '2022-03-01', 10003),
  (100004, 'Supplier 4', 'Supplier Address 4', '2022-04-01', 10004),
  (100005, 'Supplier 5', 'Supplier Address 5', '2022-05-01', 10005),
  (100006, 'Supplier 6', 'Supplier Address 6', '2022-06-01', 10006);

-- Insert data into the "employee" table
INSERT INTO employee (ssn, TIN, bdate, name)
VALUES
  (123456789, 987654321, '1990-01-01', 'Employee 1'),
  (234567890, 876543210, '1990-02-01', 'Employee 2'),
  (345678901, 765432109, '1990-03-01', 'Employee 3'),
  (456789012, 654321098, '1990-04-01', 'Employee 4'),
  (567890123, 543210987, '1990-05-01', 'Employee 5'),
  (678901234, 432109876, '1990-06-01', 'Employee 6');
  
-- Insert data into the "works" table
INSERT INTO works (ssn, name, address)
VALUES
  (123456789, 'Department 1', 'Workplace 1'),
  (234567890, 'Department 2', 'Workplace 2'),
  (345678901, 'Department 3', 'Workplace 3'),
  (456789012, 'Department 1', 'Workplace 1'),
  (567890123, 'Department 2', 'Workplace 2'),
  (678901234, 'Department 3', 'Workplace 3');
  

-- Insert data into the "process" table
INSERT INTO process (ssn, order_no)
VALUES
  (123456789, 1001),
  (234567890, 1002),
  (345678901, 1003),
  (456789012, 1004),
  (567890123, 1005),
  (678901234, 1006);

-- Insert data into the "sale" table
INSERT INTO sale (order_no, is_paid)
VALUES
  (1001, TRUE),
  (1002, FALSE),
  (1003, TRUE),
  (1004, TRUE),
  (1005, FALSE),
  (1006, TRUE);

-- Insert data into the "contains" table
INSERT INTO contains (order_no, sku, qty)
VALUES
  (1001, 10001, 5),
  (1002, 10002, 3),
  (1003, 10003, 10),
  (1004, 10004, 2),
  (1005, 10005, 4),
  (1006, 10006, 8);

*  postgresql://db:***@postgres/db
3 rows affected.
1 rows affected.
2 rows affected.
3 rows affected.
6 rows affected.
6 rows affected.
6 rows affected.
6 rows affected.
6 rows affected.
6 rows affected.
6 rows affected.
6 rows affected.
6 rows affected.

[]

## 4 Linguagem SQL

Apresente a expressão SQL correspondente a cada uma das interrogações de Álgebra Relacional.

1. Liste o nome de todos os clientes que fizeram encomendas contendo produtos de preço superior a €50 no ano de 2023;

In [28]:
%%sql

-- SELECT ...
SELECT c.name
FROM customer c
INNER JOIN order_ o USING(cust_no)
INNER JOIN contains USING(order_no)
INNER JOIN product p USING(sku)
WHERE p.price > 50 AND EXTRACT(YEAR FROM o.date_) = 2023;

*  postgresql://db:***@postgres/db
4 rows affected.

[('Mike Johnson',), ('Sarah Johnson',), ('Michael Brown',), ('Emily Davis',)]

2. Liste o nome de todos os empregados que trabalham em armazéns e não em escritórios e processaram encomendas em Janeiro de 2023;

In [29]:
%%sql

-- SELECT ...
SELECT e.name
FROM employee e
INNER JOIN works USING(ssn)
INNER JOIN warehouse USING(address)
INNER JOIN process USING(ssn)
INNER JOIN order_ o USING(order_no)
WHERE EXTRACT(YEAR FROM o.date_) = 2023 AND EXTRACT(MONTH FROM o.date_)=1
EXCEPT
SELECT e.name
FROM employee e
INNER JOIN works USING(ssn)
INNER JOIN office USING(address)
INNER JOIN process USING(ssn)
INNER JOIN order_ o USING(order_no)
WHERE EXTRACT(YEAR FROM o.date_) = 2023 AND EXTRACT(MONTH FROM o.date_)=1;

*  postgresql://db:***@postgres/db
1 rows affected.

[('Employee 1',)]

3. Indique o nome do produto mais vendido;

In [30]:
%%sql

SELECT name
FROM product
INNER JOIN contains USING(sku)
INNER JOIN sale USING(order_no)
GROUP BY sku
HAVING SUM(qty) >= ALL(
    SELECT SUM(qty)
    FROM product
    INNER JOIN contains USING(sku)
    INNER JOIN sale USING(order_no)
    GROUP BY sku
);

*  postgresql://db:***@postgres/db
1 rows affected.

[('Product 3',)]

4. Indique o valor total de cada venda realizada.

In [31]:
%%sql

SELECT s.order_no, SUM(qty*price) as "total price"
FROM sale s
INNER JOIN contains USING (order_no)
INNER JOIN product USING (sku)
GROUP BY s.order_no;

*  postgresql://db:***@postgres/db
6 rows affected.

[(1003, Decimal('509.90')),
 (1004, Decimal('121.98')),
 (1006, Decimal('647.92')),
 (1001, Decimal('54.95')),
 (1005, Decimal('283.96')),
 (1002, Decimal('62.97'))]